InformationRegisters/упРасстоянияМеждуАдресами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасстоянияМеждуАдресами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НачальныйАдрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечныйАдрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРасстоянияМеждуАдресами/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбратныйПуть") Тогда 
		Для Каждого текЗапись Из ЭтотОбъект Цикл 
			Если текЗапись.НачальныйАдрес = текЗапись.КонечныйАдрес Тогда 
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.упРасстоянияМеждуАдресами.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОбратныйПуть");
			НаборЗаписей.Отбор.НачальныйАдрес.Установить(текЗапись.КонечныйАдрес);
			НаборЗаписей.Отбор.КонечныйАдрес.Установить(текЗапись.НачальныйАдрес);
			
			ОбратныйПуть = НаборЗаписей.Добавить();
			ОбратныйПуть.НачальныйАдрес = текЗапись.КонечныйАдрес;
			ОбратныйПуть.КонечныйАдрес  = текЗапись.НачальныйАдрес;
			ОбратныйПуть.Расстояние     = текЗапись.Расстояние;
			ОбратныйПуть.Время          = текЗапись.Время;
			
			НаборЗаписей.Записать();
		КонецЦикла;	                
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
